data/macrobench/jerasure_rs_cauchy/6/stdout.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.0.32 (be patient)


Server Software:        Apache-Coyote/1.1
Server Hostname:        172.16.0.32
Server Port:            3000

Document Path:          /
Document Length:        36 bytes

Concurrency Level:      50
Time taken for tests:   167.282 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      198000 bytes
Total body sent:        4194439000
HTML transferred:       36000 bytes
Requests per second:    5.98 [#/sec] (mean)
Time per request:       8364.109 [ms] (mean)
Time per request:       167.282 [ms] (mean, across all concurrent requests)
Transfer rate:          1.16 [Kbytes/sec] received
                        24486.36 kb/s sent
                        24487.52 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  447 853.6     35    4859
Processing:   951 7804 3483.3   7583   19299
Waiting:      729 7726 3497.6   7495   19247
Total:       1090 8251 3588.9   8016   19935

Percentage of the requests served within a certain time (ms)
  50%   8016
  66%   9590
  75%  10768
  80%  11435
  90%  13482
  95%  14533
  98%  15724
  99%  16009
 100%  19935 (longest request)